sdaiPutAggrByIndex(Sdai_Id_aggr*,System.UInt32,SdaiPrimitiveType,BTEllipsis)
\details
replaces and may convert, the value of the member of the specified ordered
aggregate instance referenced by the specified index.
\param aggregate [in] aggregate instance.
\param index [in] index of the insertion place.
\param valueType [in] insert value type.
\param ... [in] values.